{
    "contact": {
        "name": "Qianshan Chen",
        "en_name": "Samuel",
        "birthday": "Augest 22, 1997",
        "tel": "+86 186-0286-0822",
        "email": "qianshan.chen15 AT student.xjtlu.edu.cn",
        "address": "Suzhou, Jiangsu, China"
    },
    "about": "My name is Qianshan Chen, an undergraduate student in XJTLU. ",
    "publications": [],
    "research": [
        {
            "title": "Applied Voice Recognition to Create Diagnose Assistants",
            "time": "September 2018 - Current",
            "efforts": [
                "FYP Project, Machine learning, Application architecture, and User Interface Design"
            ]
        },
        {
            "title": "Research and improvement of AFS (Adaptive Frontlighting System) with Arduino C language and Python Data Processing.",
            "time": "June 2018 - Augest 2018",
            "efforts":[
                "This a Machinery and Electronics project, mainly of my work is to build the controlling system using python and Arduino. Python is used to receive signal from steering wheel and Arduino is to move the light orientation."
            ]
        },
        {
            "title": "Remoted Pets Feeding machine, group work Project of EEE212.",
            "time": "April 2018 - June 2018",
            "efforts":[
                "Docker Running a MQTT server, TX2 training and running the Host machine in the product, and Remote server running and control the database of pets and front-end pages"
            ]
        },
        {
            "title": "Data Analysis with RaspberryPi, Wi-Fi localization",
            "time": "Augest 2017 - December. 2017",
            "efforts": [
                "Use RaspberryPi to collect Wi-Fi signal strength of Acess points",
                "Using Raspberry Pi as a sensor to receive the information from Wi-Fi Access Points.",
                "Use python to apply the Fingerprint algorithm to localization the devices."
            ]
        }
    ],
    "internship": [
        {
            "title": "*Software Engineer, Marketing Department, BOSCH, Shanghai",
            "time": "June 2017 - August 2017",
            "efforts": [
                "Developed a website to advertise sensor chips on sale on which customers could browse for products and contact for purchase.",
                "Maintained the WeChat public platform of the company, posting articles introducing technical statistics of the companys latest sensor chips."
            ]
        },
        {
            "title": "Big Data Software Engineer, Technical Department, HT Data Cloud Company, Suzhou.",
            "time": "July 2017 - August 2017",
            "efforts": [
                "Committed to cloud computing data and intelligent recognition technology research and application."
            ]
        }
    ],
    "extracurricular": [
        {
            "title": "Self-Developed Club fee payment APP for XJTLU Students",
            "time": "August 2017 - September 2017",
            "efforts": [
                "Independently created an app to enable students to view their class schedule on their phone and integrate it into calendars. Version 1.0 was built using PHP and Python, while version 2.0 utilized React and Node.js for better experience.",
                "Achieved over 11k users so far and reported by the schools news and local TV station."
            ]
        }, {
            "title": "*Team Member, HACKATHON Competition, Fudan University, Shanghai",
            "time": "April 2018",
            "efforts": [
                "Collaboratively designed and implemented an online decentralized exchange connecting algorithmic trading developers and investors based on Ethereum blockchain technology.",
                "Responsible for data visualization on the frontend featuring real-time trend of different cryptocurrency prices utilizing React Eschart.js and participated in applying encryption algorithms on the backend powered by Python Flask."
            ]
        }, {
            "title": "Team Leader, Apple iOS Summer Camp, Dongguan, Guangzhou",
            "time": "August 2017",
            "efforts": [
                "Teamed up with seven students from different universities nationwide and took a five-day training course on including creativity cultivation, fashion design as well as programming in Swift.",
                "Led the team and collaborated on an innovative app for users to put note memos in AR world.",
                "Gave a demo using a prototype with basic AR functionality deployed to illustrate the idea of the app and demonstrated a methodical process of planning and analyzing in the presentation."
            ]
        }
    ]
}